app/Controllers/Creneau.php

SELECT `creneaux`.*, `ressources`.`nom` as `ressource_nom`, `ressources`.`type` as `ressource_type`, `ressources`.`capacite` as `ressource_capacite`, `ressources`.`description` as `ressource_description`
FROM `creneaux`
JOIN `ressources` ON `creneaux`.`ressources_id` = `ressources`.`id`
WHERE `creneaux`.`actif` = 1
---
    public function getCreneauDispo()
    {
        $creneauModel = new CreneauxModel();

        $creneaux = $creneauModel->select('creneaux.*,
            ressources.nom as ressource_nom,
            ressources.type as ressource_type,
            ressources.capacite as ressource_capacite,
            ressources.description as ressource_description')

        ->join('ressources', 'creneaux.ressources_id = ressources.id')
        ->where('creneaux.actif', 1)
        ->findAll();