app/Controllers/User.php

INSERT INTO `users` (`nom`, `email`, `password`, `role`) VALUES ('Voara', 'voarafina@gmail.com', '$2y$10$xSqbg40cymlCRHfjD0oXZOQn0xxniHMVl8OmZc4CatSPTERoU2fm6', 'client')
---
    public function insertUser()
    {
        $model = new UserModel();
        $data = $this->request->getPost();

        $data['role'] = 'client';

        if (!$model->insert($data)) {

SELECT *
FROM `users`
WHERE `email` = 'lofo@gmail.com'
 LIMIT 1
---
    public function loginUser()
    {
        $model = new UserModel();

        $validation = \Config\Services::validation();
        $validation->setRules([
            'email'    => 'required|valid_email',
            'password' => 'required'
        ], [
            'email' => [
                'required' => 'L\'adresse email est requise.',
                'valid_email' => 'L\'adresse email doit être valide.'
            ],
            'password' => [
                'required' => 'Le mot de passe est requis.'
            ]
        ]);

        if (!$validation->withRequest($this->request)->run()) {
            return redirect()->to('/')->withInput()->with('validation', $validation->getErrors());
        }

        $email = $this->request->getPost('email');
        $password = $this->request->getPost('password');

        $user = $model->where('email', $email)->first();